/*------------------------------------------------*/
// UVA10242 CPE10566
// Fourth Point!

// 輸入說明
// 輸入4個座標，其中有2個座標相同，請找平形四邊形的第4個座標

// 思考處理
// 平行四邊形，先找中心點
// 考題可能也要先考慮共同點是哪一個

/*------------------------------------------------*/
#include <stdio.h>
#include <iostream>
#include <string>

using namespace std;

main()
{
    // 先將輸入載入2維陣列
    // at most 201 lines of inputs.
    double X1,Y1,X2,Y2,X3,Y3,X4,Y4;
    //cin >> X1>> Y1>> X2>> Y2>> X3>> Y3>> X4>> Y4;
    // X1=1.000;
    // Y1=0.000;
    // X2=3.500;
    // Y2=3.500;
    // X3=3.500;
    // Y3=3.500;
    // X4=0.000;
    // Y4=1.000;

    X1=1.866;
    Y1=0.000;
    X2=3.127;
    Y2=3.543;
    X3=3.127;
    Y3=3.543;
    X4=1.412;
    Y4=3.145;

    double S1,S2;
    //先解中心點
    S1=(X1+X4)/2;
    S2=(Y1+Y4)/2;
    
    //另一邊計算
    double X5,Y5;
    X5=2*S1-X2;
    Y5=2*S2-Y2;
    cout << X5 <<" "<<Y5 << endl;


    /*
    Sample Input
    0.000 0.000 0.000 1.000 0.000 1.000 1.000 1.000
    1.000 0.000 3.500 3.500 3.500 3.500 0.000 1.000
    1.866 0.000 3.127 3.543 3.127 3.543 1.412 3.145
    Sample Output
    1.000 0.000
    -2.500 -2.500
    0.151 -0.398
    */
}